# Day3_01 Pandas 去掉最高分和最低分的平均值

> 本文系参加《盖若 Python 训练营》的练习内容，训练营网址 https://www.gairuo.com/p/python-camp

源数据如下：

In [1]:
import pandas as pd

df = pd.read_csv(r'./team.csv')
df.sample(5)

       name team  Q1  Q2  Q3  Q4
7      Lfie    A   9  10  99  37
21    Ethan    D  79  45  89  88
41    Arlo8    E  48  34  52  51
9     Oscar    A  77   9  26  67
83  Albert0    B  85  38  41  17

我们需要去掉每个人的最高分和最低分，然后计算平均值，效果如：

```
name
Liver       44.0
Arry        37.0
Ack         58.5
Eorge       85.5
Oah         63.0
            ... 
Gabriel     66.5
Austin7     30.5
Lincoln4    56.5
Eli         66.0
Ben         42.0
Length: 100, dtype: float64
```

------

将姓名作为索引，筛选出四列成绩

In [2]:
df.set_index('name', inplace=True)

In [3]:
df = df.select_dtypes(include='int')
df

          Q1  Q2  Q3  Q4
name
Liver     89  21  24  64
Arry      36  37  37  57
Ack       57  60  18  84
Eorge     93  96  71  78
Oah       65  49  61  86
...       ..  ..  ..  ..
Gabriel   48  59  87  74
Austin7   21  31  30  43
Lincoln4  98  93   1  20
Eli       11  74  58  91
Ben       21  43  41  74

[100 rows x 4 columns]

按行排序，去掉第一个及最后一个值，并求平均值

In [4]:
df.apply(lambda x: x.sort_values()[1:-1].mean(), axis=1)

name
Liver       44.0
Arry        37.0
Ack         58.5
Eorge       85.5
Oah         63.0
            ...
Gabriel     66.5
Austin7     30.5
Lincoln4    56.5
Eli         66.0
Ben         42.0
Length: 100, dtype: float64